#+title: Artikel.cls
#+sub_title: Class for university theses and assignments, collection for all kinds of latex commands I reuse
#+property: header-args :tangle artikel.cls
#+on_save_cmd: sleep 5 && sudo make

** Star
#+begin_src latex
\iftutex
\providefontfamily{\starcorporate}{Corporate}[
Path = /home/user/.fonts/Corporate/,
Extension = .otf,
UprightFont = *E-Regular,
SmallCapsFont = *E-SC-Regular,
FontFace={l}{n}{*S-Light-Regular},
]
\newcommand{\segp}{{\starcorporate{} \textsc{Star Cooperation\raisebox{.45ex}{\scalebox{.5}{®}}}}}
\newcommand{\starlogo}{{%
\begin{minipage}[c][\arraycolsep][t]{.3\linewidth}
  \begin{center}
    \segp{} \\\vspace{-1.6ex}\rule{8.75em}{.2pt}\\\vspace{-1.3ex} \starcorporate\textl{} \scalebox{.44}{Your Partners in Excellence}
  \end{center}
\end{minipage}}}

\newcommand{\textstarlogo}{%_
% Magic number of .57cm to make logo appear vertically centered in logo
\raisebox{.57cm}{\starlogo}
}

\fi
#+end_src

#+RESULTS:
#+begin_example
\iftutex
\providefontfamily{\starcorporate}{Corporate}[
Path = /home/user/.fonts/Corporate/,
Extension = .otf,
UprightFont = *E-Regular,
SmallCapsFont = *E-SC-Regular,
FontFace={l}{n}{*S-Light-Regular},
]
\newcommand{\segp}{{\starcorporate{} \textsc{Star Cooperation\raisebox{.45ex}{\scalebox{.5}{®}}}}}
\newcommand{\starlogo}{{%
\begin{minipage}[c][\arraycolsep][t]{.3\linewidth}
  \begin{center}
    \segp{} \\\vspace{-1.6ex}\rule{8.75em}{.2pt}\\\vspace{-1.3ex} \starcorporate\textl{} \scalebox{.44}{Your Partners in Excellence}
  \end{center}
\end{minipage}}}
\fi
#+end_example

* Structural commands
#+begin_src latex
% other stuff
\newcommand{\note}[1]{\footnote{#1}}
\newcommand{\pnote}[2][]{\marginpar[#1]{#2}}
\newcommand{\unote}[1]{\footnote{~\url{#1}}}
\newcommand{\nsection}[1]{\newpage\section{#1}}
#+end_src

#+RESULTS:
#+begin_example
% other stuff
\newcommand{\note}[1]{\footnote{#1}}
\newcommand{\pnote}[2][]{\marginpar[#1]{#2}}
\newcommand{\unote}[1]{\footnote{~\url{#1}}}
\newcommand{\nsection}[1]{\newpage\section{#1}}

\titleclass{\subsubsubsection}{straight}[\subsection]

\newcounter{subsubsubsection}[subsubsection]

\renewcommand\thesubsubsubsection{\thesubsubsection.\arabic{subsubsubsection}}
\renewcommand\theparagraph{\thesubsubsubsection.\arabic{paragraph}}
\renewcommand\thesubparagraph{\theparagraph.\arabic{subparagraph}}

\titleformat{\subsubsubsection}
  {\normalfont\normalsize\bfseries}{\thesubsubsubsection}{1em}{}
\titlespacing*{\subsubsubsection}
{0pt}{3.25ex plus 1ex minus .2ex}{1.5ex plus .2ex}




\makeatletter
\renewcommand\paragraph{\@startsection{paragraph}{5}{\z@}%
  {3.25ex \@plus1ex \@minus.2ex}%
  {-1em}%
  {\normalfont\normalsize\bfseries}}
\renewcommand\subparagraph{\@startsection{subparagraph}{6}{\parindent}
  {3.25ex \@plus1ex \@minus .2ex}%
  {-1em}%
  {\normalfont\normalsize\bfseries}}
\def\toclevel@subsubsubsection{4}
\def\toclevel@paragraph{5}
\def\toclevel@paragraph{6}
\def\l@subsubsubsection{\@dottedtocline{4}{7em}{4em}}
\def\l@paragraph{\@dottedtocline{5}{10em}{5em}}
\def\l@subparagraph{\@dottedtocline{6}{14em}{6em}}
\@addtoreset{subsubsubsection}{section}
\@addtoreset{subsubsubsection}{subsection}
\@addtoreset{paragraph}{subsubsubsection}
\makeatother

\setcounter{secnumdepth}{4}
\setcounter{tocdepth}{4}
\makeatletter
\renewcommand\@makefntext[1]{\leftskip=2em\hskip-2em\@makefnmark#1}
\makeatother
#+end_example

